{"pageProps":{"blogs":[{"data":{"Id":1002,"Title":"Client Vs Server Side Rendering","Author":"Soumyajit","Tags":"React Next","Topic":"React","Abstract":"Difference between different types of rendering techniques and advantage of Next.js over React.js.","HeaderImage":"/BL-1002/next-react.jpg","isPublished":true},"content":"\r\n## Client Side Rendering {#Client-Side-Rendering}\r\n\r\n![Client Side Rendering](/BL-1002/csr.png)\r\n\r\nWhen we talk about client-side rendering,it’s about rendering content in the browser using JavaScript.\r\n\r\nSo instead of getting all the content from the HTML document itself, a simple HTML document with a JavaScript file in initial loading itself is received, which renders the rest of the site using the browser.\r\n\r\nWith client-side rendering, the initial page load is naturally a bit slow. However, after that, every subsequent page load is very fast. In this approach, communication with server happens only for getting the run-time data. Moreover, there is no need to reload the entire UI after every call to the server. The client-side framework manages to update UI with changed data by re-rendering only that particular DOM element.\r\n\r\n## Server Side Rendering {#Server-Side-Rendering}\r\n\r\n![Server Side Rendering](/BL-1002/ssr.png)\r\n\r\nIn server-side rendering when a user makes a request to a webpage, the server prepares an HTML page by fetching user-specific data and sends it to the user’s machine over the internet. Webpages are generated on your server for every request. This entire process of fetching data from the database, creating an HTML page and serve it to user is known as SSR.\r\n\r\n## Static Site Generation {#Static-Site-Generation}\r\n\r\nAt build time, your app will fetch all the data required and compile it down to static webpages. After a production build is created, every request is going to reuse that statically generated HTML file. This provides the best performance and can easily be cached on a CDN.\r\n\r\n## Problems with React.js {#Problems-with-React.js}\r\n\r\nReact uses Client Side Rendering. With React, nothing gets displayed until all of your JavaScript loads. Your HTML is nearly empty and React injects your content in your HTML with JavaScript.\r\nThis leads multiple problems:-\r\n\r\n- When the browser is loading the JavaScript, the screen is blank because `<div id=\"root\"></div>` does not show anything. Depending on the size of your JavaScript bundle, this could lead to your visitors staring at a white screen for a couple of seconds.\r\n\r\n- Most SEO crawlers do not have JavaScript enabled. DuckDuckGo, Google, Bing and any other search engine would not actually know what is on your website since it requires JavaScript to display the content. You will not be ranked at all on Search Engines.\r\n\r\n## Methods for Prerendering using Next.js {#Methods-for-Prerendering-using-Next.js}\r\n\r\nNext.js offers `(Server Side Rendering)SSR` and `(Static Site Generation)SSG` using `getStaticProps` and `getServerSideProps`.\r\n\r\n### getStaticProps {#getStaticProps}\r\n\r\ngetStaticProps is a server-side function that will only be called at build time. The build will then use the response from getStaticProps to generate a static webpage.\r\n\r\nSince stale data is a problem with static generated pages, there is an option you can set to revalidate your static page and rebuild it if data changes. revalidate: 60 will check your data every 60 seconds and rebuild the page if needed.\r\n\r\nExample Use:\r\n\r\n```\r\n// This function gets called at build time on server-side.\r\nexport async function getStaticProps() {\r\nconst res = await fetch('https://.../data');\r\nconst data = await res.json();\r\n\r\n// By returning { props: data }, the Dashboard component\r\n// will receive `data` as a prop at build time\r\nreturn {\r\nprops: {\r\ndata\r\n},\r\n// Check if data changes every 60 seconds.\r\n// Rebuild page if different\r\nrevalidate: 60\r\n};\r\n}\r\n\r\n// data will be populated at build time by getStaticProps()\r\nexport default function Dashboard({ data }) {\r\nreturn <div>{data}</div>;\r\n}\r\n```\r\n\r\n### getServerSideProps {#getServerSideProps}\r\n\r\ngetServerSideProps is similar to getStaticProps but is called every time the page loads instead of at build time. This ensures that all of your initial data is up to date on every load.\r\n\r\nSince this is called on every load, you do not need to revalidate like getStaticProps. This also leads to a slower load time since you are no longer serving a static file, but have to rebuild on every load.\r\n\r\nExample Use:\r\n\r\n```\r\n// This function gets called at build time on server-side.\r\nexport async function getServerSideProps() {\r\nconst res = await fetch('https://.../data');\r\nconst data = await res.json();\r\n\r\n// By returning { props: data }, the Dashboard component\r\n// will receive `data` as a prop at build time\r\nreturn {\r\nprops: {\r\ndata\r\n}\r\n};\r\n}\r\n\r\n// data will be populated at build time by getServerSideProps()\r\nexport default function Dashboard({ data }) {\r\nreturn <div>{data}</div>;\r\n}\r\n```\r\n\r\n## Benefits of using Next.js {#Benefits-of-using-Next.js}\r\n\r\n- Search engines can crawl the site for better SEO.\r\n- The initial page load is faster.\r\n  ![nextjs pros and cons](/BL-1002/nextjs-pros-and-cons.png)\r\n\r\n**References:**\r\n\r\n- <a href=\"https://nextjs.org/docs/getting-started\" target=\"_blank\">Next.js</a>\r\n","readTime":{"text":"4 min read","minutes":3.73,"time":223800,"words":746}},{"data":{"Id":1003,"Title":"Core Concept You Need to Know About React","Author":"Soumyajit","Tags":"React Interview","Topic":"React","Abstract":"Learning some of the fundamental concepts of React.js and top questions asked in react interview.","HeaderImage":"/BL-1003/reactjs.png","isPublished":true},"content":"\r\n## Why use react.js {#Why-use-react.js}\r\n\r\n**_1.Reusable Components:_**\r\n\r\nReact provides a component based structure.Each tiny elements like button, checkbox, dropdown etc can be a component and the we create wrapper components composed of those smaller components.Each component decides how it should be rendered. Each component has its own internal logic.\r\n\r\n**_2.Fast render with Virtual DOM_**\r\n\r\nReact uses virtual DOM to render the view.virtual DOM is a virtual representation of the real DOM. Each time the data changes in a react app, a new virtual DOM gets created. Creating a virtual DOM is much faster than rendering the UI inside the browser. Therefore, with the use of virtual DOM, the efficiency of the app improves.\r\n\r\n**_3.SEO friendly_**\r\n\r\nReact allows developers to develop user interfaces that can be easily navigated in various search engines. It also allows server-side rendering, which boosts the SEO of an app.\r\n\r\n## What is JSX? {#What-is-JSX}\r\n\r\nJSX stands for JavaScript XML.\r\nIt allows us to write HTML inside JavaScript and place them in the DOM without using functions like `appendChild( )` or `createElement( )`.\r\n\r\n- Without using JSX, we would have to create an element by the following process:\r\n\r\n```\r\nconst text = React.createElement('p', {}, 'This is a text');\r\nconst container = React.createElement('div','{}',text );\r\nReactDOM.render(container,document.getElementById('app'));\r\n```\r\n\r\n- Using JSX, the above code can be simplified:\r\n\r\n````\r\nconst container = (\r\n\r\n <div>\r\n   <p>This is a text</p>\r\n </div>\r\n);\r\nReactDOM.render(container,document.getElementById('app'));```\r\n````\r\n\r\nAs one can see in the code above, we are directly using HTML inside JavaScript\\*\r\n\r\n## What is the virtual DOM? How does react use the virtual DOM to render the UI? {#What-is-the-virtual-DOM-How-does-react-use-the-virtual-DOM-to-render-the-UI}\r\n\r\n_DOM stands for 'Document Object Model'. In simple terms, it is a structured representation of the HTML elements that are present in a webpage or web-app. DOM represents the entire UI of your application_\r\n\r\nVirtual DOM is a concept where a virtual representation of the real DOM is kept inside the memory and is synced with the real DOM by a library such as ReactDOM.\r\n\r\n![Virtual Dom](/BL-1003/vdom.png)\r\n\r\n**Why was virtual DOM introduced?**\r\n\r\nDOM manipulation is an integral part of any web application, but DOM manipulation is quite slow when compared to other operations in JavaScript.\r\n\r\nThe efficiency of the application gets affected when several DOM manipulations are being done. Most JavaScript frameworks update the entire DOM even when a small part of the DOM changes.\r\n\r\nFor example, consider a list that is being rendered inside the DOM. If one of the items in the list changes, the entire list gets rendered again instead of just rendering the item that was changed/updated. This is called inefficient updating.\r\nTo address the problem of inefficient updating, the react team introduced the concept of virtual DOM.\r\n\r\n**How does it work?**\r\n\r\n![Virtual Dom](/BL-1003/real-virtual.png)\r\n\r\nFor every DOM object, there is a corresponding virtual DOM object(copy), which has the same properties.\r\n\r\nThe main difference between the real DOM object and the virtual DOM object is that any changes in the virtual DOM object will not reflect on the screen directly. Consider a virtual DOM object as a blueprint of the real DOM object.\r\nWhenever a JSX element gets rendered, every virtual DOM object gets updated.\r\n\r\nReact uses two virtual DOMs to render the user interface. One of them is used to store the current state of the objects and the other to store the previous state of the objects.\r\n\r\nWhenever the virtual DOM gets updated, react compares the two virtual DOMs and gets to know about which virtual DOM objects were updated.\r\n\r\nAfter knowing which objects were updated, react renders only those objects inside the real DOM instead of rendering the complete real DOM.This way, with the use of virtual DOM, react solves the problem of inefficient updating\r\n\r\n## Explain React state and props? {#Explain-React-state-and-props}\r\n\r\nA React component can access dynamic information in two ways: props and state.\r\n\r\n### React State {#React-State}\r\n\r\nEvery component in react has a built-in state object, which contains all the property values that belong to that component.\r\n\r\nIn other words, the state object controls the behaviour of a component. Any change in the property values of the state object leads to re-rendering of the component.\r\n\r\n_Note- State object is not available in functional components but, we can use React Hooks to add state to a functional component._\r\n\r\nHow to declare a state object?\r\n\r\n```\r\nExample:\r\nclass Car extends React.Component{\r\n constructor(props){\r\n   super(props);\r\n   this.state = {\r\n     brand: \"BMW\",\r\n     color: \"black\"\r\n   }\r\n }\r\n}\r\n```\r\n\r\nHow to use and update the state object?\r\n\r\n```\r\nclass Car extends React.Component {\r\n constructor(props) {\r\n   super(props);\r\n   this.state = {\r\n     brand: \"BMW\",\r\n     color: \"Black\"\r\n   };\r\n }\r\n\r\n changeColor() {\r\n   this.setState(prevState => {\r\n     return { color: \"Red\" };\r\n   });\r\n }\r\n\r\n render() {\r\n   return (\r\n     <div>\r\n       <button onClick={() => this.changeColor()}>Change Color</button>\r\n       <p>{this.state.color}</p>\r\n     </div>\r\n   );\r\n }\r\n}\r\n\r\n```\r\n\r\nAs one can see in the code above, we can use the state by calling this.state.propertyName and we can change the state object property using setState method.\r\n\r\n### React Props {#React-Props}\r\n\r\nEvery react component, accepts a single object argument called props (which stands for “properties”).\r\n\r\nThese props can be passed to a component using HTML attributes.\r\n\r\nUsing props, we can pass data from one component to another.\r\n\r\n- While rendering a component, we can pass the props as a HTML attribute:\r\n\r\n```\r\n<Car brand=\"Mercedes\"/>\r\n```\r\n\r\nThe component receives the props:\r\n\r\n- In Class component:\r\n\r\n```\r\nclass Car extends React.Component {\r\n constructor(props) {\r\n   super(props);\r\n   this.state = {\r\n     brand: this.props.brand,\r\n     color: \"Black\"\r\n   };\r\n }\r\n}\r\n```\r\n\r\n- In Functional component:\r\n\r\n```\r\nfunction Car(props) {\r\n  render() {\r\n      return <h1>Name is {props.name}!</h1>;\r\n   }\r\n}\r\n```\r\n\r\n**Note- Props are read-only. They cannot be manipulated or changed inside a component**\r\n\r\n## Explain React Hooks? {#Explain-React-Hooks}\r\n\r\nHooks are functions that let us “hook into” React state and lifecycle features from a `functional component.`\r\nReact Hooks cannot be used in class components.\r\n\r\nWhy were Hooks introduced in React?\r\nReact hooks were introduced in the 16.8 version of React.\r\nPreviously, functional components were called stateless components. Only class components were used for state management and lifecycle methods.\r\n\r\nThe need to change a functional component to a class component, whenever state management or lifecycle methods were to be used, led to the development of Hooks.\r\n\r\n**Example of a hook:**\r\n\r\n`useState hook:`\r\nIn functional components, useState hook lets us define state for a component:\r\n\r\n```\r\nfunction Person(props) {\r\n // We are declaring a state variable called name.\r\n // setName is a function to update/change the value of name\r\n let [name, setName] = useState('');\r\n}\r\n```\r\n\r\n## What are the different lifecycle methods in React? {#What-are-the-different-lifecycle-methods-in-React}\r\n\r\nEach component in react goes through three phases: `Mounting`, `Updating`, and `Unmounting`.\r\n\r\n- **Mounting** :- Birth of your component\r\n- **Update** :- Growth of your component\r\n- **Unmount** :- Death of your component\r\n\r\n![React Life Cycle Methods](/BL-1003/ReactLifeCycle.png)\r\n\r\n### Common React Lifecycle Methods {#Common-React-Lifecycle-Methods}\r\n\r\n- **constructor()**\r\n\r\nThis is used only if you have a class-based Component and it serves the purpose of initializing the state of a Component. In case of functional Components, the useState() hook is used to do the same.\r\n\r\n- **render()**\r\n\r\nThis is the method that is `responsible for inserting a Component into the DOM`.\r\n\r\nThe render() method is the most used lifecycle method. This is because render() is the only required method within a class component in React.\r\n\r\nIt happens during the `mounting` and `updating` of your component.\r\n\r\n```\r\nBelow is an example of a simple render() in React.\r\n\r\nclass Hello extends Component{\r\n   render(){\r\n      return <div>Hello {this.props.name}</div>\r\n   }\r\n}\r\n\r\n```\r\n\r\n**A render() can also return a null if there is nothing to render for that component.**\r\n\r\n- **componentDidMount()**\r\n\r\nThis is invoked `after a Component is inserted into the DOM for the first time`.\r\n\r\nWhen component has been mounted and ready, that’s when the next React lifecycle method componentDidMount() comes in play.\r\n\r\ncomponentDidMount() is called as soon as the component is mounted and ready. This is a good place to initiate API calls, if you need to load data from a remote endpoint.\r\n\r\n`componentDidMount() allows the use of setState()`.\r\n\r\n- **componentDidUpdate()**\r\n\r\nThis is the method invoked after `re-rendering an updated Component`. This method can give you the information about a Component’s previous state and previous props. This lifecycle method is invoked as soon as the updating happens. The most common use case for the componentDidUpdate() method is updating the DOM in response to prop or state changes.\r\n\r\nYou can call setState() in this lifecycle, but keep in mind that you will need to wrap it in a condition to check for state or prop changes from previous state. Incorrect usage of setState() can lead to an infinite loop.\r\n\r\n```\r\nTake a look at the example below that shows a typical usage example of this lifecycle method.\r\n\r\ncomponentDidUpdate(prevProps) {\r\n//Typical usage, don't forget to compare the props\r\nif (this.props.userName !== prevProps.userName) {\r\nthis.fetchData(this.props.userName);\r\n}\r\n}\r\n\r\n```\r\n\r\nNotice in the above example that we are comparing the current props to the previous props. This is to check if there has been a change in props from what it currently is. In this case, there won’t be a need to make the API call if the props did not change.\r\n\r\n- **componentWillUnmount()**\r\n\r\nAs the name suggests this lifecycle method is called just `before the component is unmounted and destroyed`.\r\n\r\nYou cannot modify the component state in componentWillUnmount lifecycle.\r\n\r\nThis is where you can perform any cleanups that need to be done such as invalidating timers, canceling network requests, removing event listeners, and so on.\r\n\r\n```\r\ncomponentWillUnmount() {\r\nwindow.removeEventListener('resize', this.resizeListener)\r\n}\r\n```\r\n\r\n## What are keys in React? {#What-are-keys-in-React}\r\n\r\nA key is a special string attribute that needs to be included when using lists of elements.\r\n\r\nExample of a list using key:\r\n\r\n```\r\nconst ids = [1,2,3,4,5];\r\nconst listElements = ids.map((id)=>{\r\nreturn(\r\n <li key={id.toString()}>\r\n   {id}\r\n </li>\r\n )\r\n})\r\n```\r\n\r\n**Importance of keys:-**\r\n\r\n- Keys help react identify which elements were added, changed or removed.\r\n- Keys should be given to array elements for providing a unique identity for each element.\r\n- Without keys, React does not understand the order or uniqueness of each element.\r\n- With keys, React has an idea of which particular element was deleted,edited, and added.\r\n\r\n## React pure component {#React-pure-component}\r\n\r\nA React component is considered pure if it renders the same output for the same state and props. For class components like this, React provides the PureComponent base class. Class components that extend the `React.PureComponent` class are treated as `pure components`.\r\n\r\nPure components have some performance improvements and render optimizations since React implements the shouldComponentUpdate() method for them with a shallow comparison for props and state.\r\n\r\n**Features of React Pure Components**\r\n\r\n- Prevents re-rendering of Component if props or state is the same\r\n- Takes care of “shouldComponentUpdate” implicitly\r\n- State and Props are Shallow Compared\r\n- Pure Components are more performant in certain cases\r\n\r\n**React Components re-renders in the following scenarios:**\r\n\r\n- “setState” is called in Component\r\n- “props” values are updated\r\n- this.forceUpdate() is called\r\n\r\n`In the case of Pure Components, the React components do not re-render blindly without considering the updated values of React “props” and “state”. If updated values are the same as previous values, render is not triggered.`\r\n","readTime":{"text":"10 min read","minutes":9.235,"time":554100,"words":1847}},{"data":{"Id":1010,"Title":"React Lifecycle Methods","Author":"Soumyajit","Tags":"React Interview","Topic":"React","Abstract":"Lifecycle methods are series of events that happen throughout the birth, growth, and death of a React component.","HeaderImage":"/BL-1010/Header.jpg","isPublished":true},"content":"\r\n**Visual overview of topics covered in this tutorial**\r\n\r\n![Lifecycle](/BL-1010/Lifecycle.png)\r\n\r\n## What is the React component lifecycle? {#What-is-the-React-component-lifecycle}\r\n\r\nIn React, components go through a lifecycle of events:\r\n\r\n- Mounting (adding nodes to the DOM)\r\n- Updating (altering existing nodes in the DOM)\r\n- Unmounting (removing nodes from the DOM)\r\n\r\n## Mounting lifecycle methods {#Mounting-lifecycle-methods}\r\n\r\nThe mounting phase refers to the phase during which a component is created and inserted to the DOM.\r\nThe following methods are called in order.\r\n\r\n- constructor()\r\n- static getDerivedStateFromProps()\r\n- render()\r\n- componentDidMount()\r\n\r\n### constructor() {#constructor}\r\n\r\nThe constructor() is the very first method that is invoked before the component is mounted to the DOM.\r\n\r\nThe constructor method is called before the component is mounted to the DOM. In most cases, you would initialize state and bind event handlers methods within the constructor method.\r\n\r\nExample of the constructor() React lifecycle method in action:\r\n\r\n```\r\nconst MyComponent extends React.Component {\r\n  constructor(props) {\r\n   super(props)\r\n    this.state = {\r\n       points: 0\r\n    }\r\n    this.handlePoints = this.handlePoints.bind(this)\r\n    }\r\n}\r\n```\r\n\r\n### static getDerivedStateFromProps() {#static-getDerivedStateFromProps}\r\n\r\nIts main function is to ensure that the state and props are in sync for when it’s required.\r\n\r\nThe basic structure of the static getDerivedStateFromProps() looks like this:\r\n\r\n```\r\nstatic getDerivedStateFromProps(props, state) {\r\n  //do stuff here\r\n}\r\n```\r\n\r\n```\r\nYou can return an object to update the state of the component:\r\n\r\nstatic getDerivedStateFromProps(props, state) {\r\n    return {\r\n       points: 200 // update state with this\r\n    }\r\n}\r\n\r\nOr you can return null to make no updates:\r\n\r\nstatic getDerivedStateFromProps(props, state) {\r\n return null\r\n}\r\n```\r\n\r\n```\r\nclass App extends Component {\r\n  state = {\r\n    points: 10\r\n  }\r\n\r\n  // *******\r\n  //  NB: Not the recommended way to use this method. Just an example. Unconditionally overriding state here is generally considered a bad idea\r\n  // ********\r\n\r\n  static getDerivedStateFromProps(props, state) {\r\n    return {\r\n      points: 1000\r\n    }\r\n  }\r\n\r\n  render() {\r\n    return (\r\n      <div className=\"App\">\r\n        <header className=\"App-header\">\r\n          <img src={logo} className=\"App-logo\" alt=\"logo\" />\r\n          <p>\r\n            You've scored {this.state.points} points.\r\n          </p>\r\n        </header>\r\n      </div>\r\n    );\r\n  }\r\n}\r\n\r\nThe 1000 comes from updating state within the static getDerivedStateFromProps method.\r\n\r\n```\r\n\r\n### render() {#render}\r\n\r\nAs the name suggests it handles the rendering of your component to the UI\r\n\r\n```\r\nclass Hello extends Component{\r\n   render(){\r\n      return <div>Hello {this.props.name}</div>\r\n   }\r\n}\r\n```\r\n\r\nThe render() method returns JSX that is displayed in the UI. A render() can also return a null if there is nothing to render for that component.\r\n\r\nA render() method has to be pure with no side-effects.\r\nReact requires that your render() is pure. Pure functions are those that do not have any side-effects and will always return the same output when the same inputs are passed. This means that you can not `setState() within a render()`. `You cannot modify the component state within the render().`\r\n\r\n### componentDidMount {#componentDidMount}\r\n\r\nAfter render is called, `the component is mounted to the DOM and the componentDidMount method is invoked.`\r\n\r\nThis function is invoked immediately after the component is mounted to the DOM.\r\n\r\nYou would use the componentDidMount lifecycle method to grab a DOM node from the component tree immediately after it’s mounted.\r\n\r\n**If you also want to make network requests as soon as the component is mounted to the DOM, this is a perfect place to do so.**\r\n\r\n```\r\ncomponentDidMount() {\r\n  this.fetchListOfTweets() // where fetchListOfTweets initiates a netowrk request to fetch a certain list of tweets.\r\n}\r\n```\r\n\r\n**You could also set up subscriptions such as timers**\r\n\r\n```\r\n// e.g requestAnimationFrame\r\ncomponentDidMount() {\r\n    window.requestAnimationFrame(this._updateCountdown);\r\n }\r\n```\r\n\r\n## Updating lifecycle methods {#Updating-lifecycle-methods}\r\n\r\nWhenever a change is made to the state or props of a React component, the component is rerendered. In simple terms, the component is updated. This is the updating phase of the React component lifecycle.\r\n\r\n- shouldComponentUpdate()\r\n- render()\r\n- getSnapshotBeforeUpdate()\r\n- componentDidUpdate()\r\n\r\n### shouldComponentUpdate() {#shouldComponentUpdate}\r\n\r\nIn most cases, you’ll want a component to rerender when state or props changes. However, you do have control over this behavior.\r\n\r\nWithin this lifecycle method, you can return a boolean true or false and control whether the component gets rerendered (e.g., upon a change in state or props).\r\n\r\n```\r\nshouldComponentUpdate(nextProps, nextState)\r\n{\r\n return this.props.title !== nextProps.title ||\r\n  this.state.input !== nextState.input\r\n}\r\n```\r\n\r\n### render() {#render}\r\n\r\nAfter the shouldComponentUpdate method is called, render is called immediately afterward, depending on the returned value from shouldComponentUpdate, which defaults to true.\r\n\r\n### getSnapshotBeforeUpdate() {#getSnapshotBeforeUpdate}\r\n\r\nThe getSnapshotBeforeUpdatelifecycle method stores the previous values of the state after the DOM is updated. getSnapshotBeforeUpdate() is called right after the render method.\r\n\r\n```\r\ngetSnapshotBeforeUpdate(prevProps, prevState) {\r\n\r\n}\r\n```\r\n\r\nHere’s the important thing: the value queried from the DOM in getSnapshotBeforeUpdate refers to the `value just before the DOM is updated, even though the render method was previously called`.\r\n\r\n`The getSnapshotBeforeUpdate React lifecycle method doesn’t work on its own. It is meant to be used in conjunction with the componentDidUpdate lifecycle method`.\r\n\r\n### componentDidUpdate() {#componentDidUpdate}\r\n\r\nThe componentDidUpdate lifecycle method is invoked after the getSnapshotBeforeUpdate. As with the getSnapshotBeforeUpdate method it receives the previous props and state as arguments:\r\n\r\n```\r\ncomponentDidUpdate(prevProps, prevState) {\r\n\r\n}\r\n```\r\n\r\nHowever it also takes whatever value is returned from the getSnapshotBeforeUpdate lifecycle method is passed as the third argument to the componentDidUpdate method.\r\n\r\n```\r\ncomponentDidUpdate(prevProps, prevState, snapshot) {\r\n\r\n}\r\n```\r\n\r\n## Unmounting lifecycle method {#Unmounting-lifecycle-method}\r\n\r\nThe following method is invoked during the component unmounting phase\r\n\r\n- componentWillUnmount()\r\n\r\n### componentWillUnmount() {#componentWillUnmount}\r\n\r\nThe componentWillUnmount lifecycle method is invoked immediately before a component is unmounted and destroyed. This is the ideal place to perform any necessary cleanup such as clearing up timers, cancelling network requests, or cleaning up any subscriptions that were created in componentDidMount().\r\n\r\n```\r\n// e.g add event listener\r\ncomponentDidMount() {\r\n  el.addEventListener()\r\n}\r\n```\r\n\r\n```\r\n// e.g remove event listener\r\ncomponentWillUnmount() {\r\n  el.removeEventListener()\r\n}\r\n```\r\n\r\n**References:**\r\n\r\n- <a href=\"https://programmingwithmosh.com/javascript/react-lifecycle-methods\" target=\"_blank\">React Lifecycle Methods- A Deep Dive</a>\r\n- <a href=\"https://blog.logrocket.com/react-lifecycle-methods-tutorial-examples\" target=\"_blank\">React lifecycle methods: An approachable tutorial with examples</a>\r\n","readTime":{"text":"5 min read","minutes":4.81,"time":288600,"words":962}}],"topics":["Git","React","Javascript"],"topicName":"React"},"__N_SSG":true}